[
  {
    "title": "Most Parked Domains Now Serving Malicious Content",
    "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
    "published": "Tue, 16 Dec 2025 14:14:48 +0000",
    "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware."
  },
  {
    "title": "Microsoft Patch Tuesday, December 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
    "published": "Tue, 09 Dec 2025 23:18:29 +0000",
    "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities."
  },
  {
    "title": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
    "link": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
    "published": "Sat, 06 Dec 2025 14:45:03 +0000",
    "summary": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia's war against Ukraine."
  },
  {
    "title": "SMS Phishers Pivot to Points, Taxes, Fake Retailers",
    "link": "https://krebsonsecurity.com/2025/12/sms-phishers-pivot-to-points-taxes-fake-retailers/",
    "published": "Thu, 04 Dec 2025 23:02:34 +0000",
    "summary": "China-based phishing groups blamed for non-stop scam SMS messages about a supposed wayward package or unpaid toll fee are promoting a new offering, just in time for the holiday shopping season: Phishing kits for mass-creating fake but convincing e-commerce websites that convert customer payment card data into mobile wallets from Apple and Google. Experts say these same phishing groups also are now using SMS lures that promise unclaimed tax refunds and mobile rewards points."
  },
  {
    "title": "Meet Rey, the Admin of ‘Scattered Lapsus$ Hunters’",
    "link": "https://krebsonsecurity.com/2025/11/meet-rey-the-admin-of-scattered-lapsus-hunters/",
    "published": "Wed, 26 Nov 2025 17:22:36 +0000",
    "summary": "A prolific cybercriminal group that calls itself \"Scattered LAPSUS$ Hunters\" made headlines regularly this year by stealing data from and publicly mass extorting dozens of major corporations. But the tables seem to have turned somewhat for \"Rey,\" the moniker chosen by the technical operator and public face of the hacker group: Earlier this week, Rey confirmed his real life identity and agreed to an interview after KrebsOnSecurity tracked him down and contacted his father."
  },
  {
    "title": "Is Your Android TV Streaming Box Part of a Botnet?",
    "link": "https://krebsonsecurity.com/2025/11/is-your-android-tv-streaming-box-part-of-a-botnet/",
    "published": "Mon, 24 Nov 2025 18:44:52 +0000",
    "summary": "On the surface, the Superbox media streaming devices for sale at retailers like BestBuy and Walmart may seem like a steal: They offer unlimited access to more than 2,200 pay-per-view and streaming services like Netflix, ESPN and Hulu, all for a one-time fee of around $400. But security experts warn these TV boxes require intrusive software that forces the user's network to relay Internet traffic for others, traffic that is often tied to cybercrime activity such as advertising fraud and account takeovers."
  },
  {
    "title": "Mozilla Says It’s Finally Done With Two-Faced Onerep",
    "link": "https://krebsonsecurity.com/2025/11/mozilla-says-its-finally-done-with-two-faced-onerep/",
    "published": "Thu, 20 Nov 2025 19:06:51 +0000",
    "summary": "In March 2024, Mozilla said it was winding down its collaboration with Onerep -- an identity protection service offered with the Firefox web browser that promises to remove users from hundreds of people-search sites -- after KrebsOnSecurity revealed Onerep's founder had created dozens of people-search services and was continuing to operate at least one of them. Sixteen months later, however, Mozilla is still promoting Onerep. This week, Mozilla announced their partnership with Onerep will officially end next month."
  },
  {
    "title": "The Cloudflare Outage May Be a Security Roadmap",
    "link": "https://krebsonsecurity.com/2025/11/the-cloudflare-outage-may-be-a-security-roadmap/",
    "published": "Wed, 19 Nov 2025 14:07:03 +0000",
    "summary": "An intermittent outage at Cloudflare on Tuesday briefly knocked many of the Internet's top destinations offline. Some affected Cloudflare customers were able to pivot away from the platform temporarily so that visitors could still access their websites. But security experts say doing so may have also triggered an impromptu network penetration test for organizations that have come to rely on Cloudflare to block many types of abusive and malicious traffic."
  },
  {
    "title": "Microsoft Patch Tuesday, November 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/11/microsoft-patch-tuesday-november-2025-edition/",
    "published": "Sun, 16 Nov 2025 21:47:14 +0000",
    "summary": "Microsoft this week pushed security updates to fix more than 60 vulnerabilities in its Windows operating systems and supported software, including at least one zero-day bug that is already being exploited. Microsoft also fixed a glitch that prevented some Windows 10 users from taking advantage of an extra year of security updates, which is nice because the zero-day flaw and other critical weaknesses patched today affect all versions of Windows, including Windows 10."
  },
  {
    "title": "Google Sues to Disrupt Chinese SMS Phishing Triad",
    "link": "https://krebsonsecurity.com/2025/11/google-sues-to-disrupt-chinese-sms-phishing-triad/",
    "published": "Thu, 13 Nov 2025 14:47:22 +0000",
    "summary": "Google is suing more than two dozen unnamed individuals allegedly involved in peddling a popular China-based mobile phishing service that helps scammers impersonate hundreds of trusted brands, blast out text message lures, and convert phished payment card data into mobile wallets from Apple and Google."
  },
  {
    "title": "HPE warns of maximum severity RCE flaw in OneView software",
    "link": "https://www.bleepingcomputer.com/news/security/hpe-warns-of-maximum-severity-rce-flaw-in-oneview-software/",
    "published": "Thu, 18 Dec 2025 06:35:53 -0500",
    "summary": "Hewlett Packard Enterprise (HPE) has patched a maximum-severity vulnerability in its HPE OneView software that enables attackers to execute arbitrary code remotely. [...]"
  },
  {
    "title": "Microsoft: Recent Windows updates break RemoteApp connections",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-recent-updates-break-azure-virtual-desktop-remoteapp-sessions/",
    "published": "Thu, 18 Dec 2025 05:04:25 -0500",
    "summary": "Microsoft has confirmed that recent Windows updates trigger RemoteApp connection failures on Windows 11 24H2/25H2 and Windows Server 2025 devices in Azure Virtual Desktop environments. [...]"
  },
  {
    "title": "Zeroday Cloud hacking event awards $320,0000 for 11 zero days",
    "link": "https://www.bleepingcomputer.com/news/security/zeroday-cloud-hacking-event-awards-320-0000-for-11-zero-days/",
    "published": "Wed, 17 Dec 2025 18:09:36 -0500",
    "summary": "The Zeroday Cloud hacking competition in London has awarded researchers $320,000 for demonstrating critical remote code execution vulnerabilities in components used in cloud infrastructure. [...]"
  },
  {
    "title": "France arrests suspect tied to cyberattack on Interior Ministry",
    "link": "https://www.bleepingcomputer.com/news/security/france-arrests-suspect-tied-to-cyberattack-on-interior-ministry/",
    "published": "Wed, 17 Dec 2025 17:20:02 -0500",
    "summary": "French authorities arrested a 22-year-old suspect on Tuesday for a cyberattack that targeted France's Ministry of the Interior earlier this month. [...]"
  },
  {
    "title": "Amazon: Ongoing cryptomining campaign uses hacked AWS accounts",
    "link": "https://www.bleepingcomputer.com/news/security/amazon-ongoing-cryptomining-campaign-uses-hacked-aws-accounts/",
    "published": "Wed, 17 Dec 2025 16:48:33 -0500",
    "summary": "Amazon's AWS GuardDuty security team is warning of an ongoing crypto-mining campaign that targets its Elastic Compute Cloud (EC2) and Elastic Container Service (ECS) using compromised credentials for Identity and Access Management (IAM). [...]"
  },
  {
    "title": "WhatsApp device linking abused in account hijacking attacks",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-device-linking-abused-in-account-hijacking-attacks/",
    "published": "Wed, 17 Dec 2025 14:14:30 -0500",
    "summary": "Threat actors are abusing the legitimate device-linking feature to hijack WhatsApp accounts via pairing codes in a campaign dubbed GhostPairing. [...]"
  },
  {
    "title": "Cisco warns of unpatched AsyncOS zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-unpatched-asyncos-zero-day-exploited-in-attacks/",
    "published": "Wed, 17 Dec 2025 13:45:36 -0500",
    "summary": "​Cisco warned customers today of an unpatched, maximum-severity Cisco AsyncOS zero-day actively exploited in attacks targeting Secure Email Gateway (SEG) and Secure Email and Web Manager (SEWM) appliances. [...]"
  },
  {
    "title": "Sonicwall warns of new SMA1000 zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-warns-of-new-sma1000-zero-day-exploited-in-attacks/",
    "published": "Wed, 17 Dec 2025 12:44:18 -0500",
    "summary": "SonicWall warned customers today to patch a vulnerability in the SonicWall SMA1000 Appliance Management Console (AMC) that was chained in zero-day attacks to escalate privileges. [...]"
  },
  {
    "title": "Critical React2Shell flaw exploited in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/critical-react2shell-flaw-exploited-in-ransomware-attacks/",
    "published": "Wed, 17 Dec 2025 11:09:51 -0500",
    "summary": "A ransomware gang exploited the critical React2Shell vulnerability (CVE-2025-55182) to gain initial access to corporate networks and deployed the file-encrypting malware less than a minute later. [...]"
  },
  {
    "title": "Your MFA Is Costing You Millions. It Doesn't Have To.",
    "link": "https://www.bleepingcomputer.com/news/security/your-mfa-is-costing-you-millions-it-doesnt-have-to/",
    "published": "Wed, 17 Dec 2025 09:00:00 -0500",
    "summary": "Passwords and app-based MFA add hidden costs through lost productivity, frequent resets, and risk of phishing and social engineering attacks. Token explains how wireless biometric, passwordless authentication eliminates credential-based attacks and delivers measurable financial returns by reducing login time across the enterprise. [...]"
  },
  {
    "title": "Microsoft asks admins to reach out for Windows IIS failures fix",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-asks-it-admins-to-reach-out-for-windows-iis-failures-fix/",
    "published": "Wed, 17 Dec 2025 07:30:32 -0500",
    "summary": "Microsoft has asked businesses to reach out for advice on how to temporarily mitigate a Message Queuing (MSMQ) issue causing enterprise apps and Internet Information Services (IIS) sites to fail. [...]"
  },
  {
    "title": "Cellik Android malware builds malicious versions from Google Play apps",
    "link": "https://www.bleepingcomputer.com/news/security/cellik-android-malware-builds-malicious-versions-from-google-play-apps/",
    "published": "Tue, 16 Dec 2025 17:59:35 -0500",
    "summary": "A new Android malware-as-a-service (MaaS) named Cellik is being advertised on underground cybercrime forums offering a robust set of capabilities that include the option to embed it in any app available on the Google Play Store. [...]"
  },
  {
    "title": "GhostPoster attacks hide malicious JavaScript in Firefox addon logos",
    "link": "https://www.bleepingcomputer.com/news/security/ghostposter-attacks-hide-malicious-javascript-in-firefox-addon-logos/",
    "published": "Tue, 16 Dec 2025 17:17:46 -0500",
    "summary": "A new campaign dubbed 'GhostPoster' is hiding JavaScript code in the image logo of malicious Firefox extensions counting more than 50,000 downloads, to monitor browser activity and plant a backdoor. [...]"
  },
  {
    "title": "Access Fabric: A modern approach to identity and network access",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/17/access-fabric-a-modern-approach-to-identity-and-network-access/",
    "published": "Wed, 17 Dec 2025 17:00:00 +0000",
    "summary": "<p>An Access Fabric is a unified access security solution that continuously decides who can access what, from where, and under what conditions—in real time.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/17/access-fabric-a-modern-approach-to-identity-and-network-access/\">Access Fabric: A modern approach to identity and network access</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Defending against the CVE-2025-55182 (React2Shell) vulnerability in React Server Components",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/15/defending-against-the-cve-2025-55182-react2shell-vulnerability-in-react-server-components/",
    "published": "Mon, 15 Dec 2025 19:35:00 +0000",
    "summary": "<p>CVE-2025-55182 (also referred to as React2Shell and includes CVE-2025-66478, which was merged into it) is a critical pre-authentication remote code execution (RCE) vulnerability affecting React Server Components and related frameworks.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/15/defending-against-the-cve-2025-55182-react2shell-vulnerability-in-react-server-components/\">Defending against the CVE-2025-55182 (React2Shell) vulnerability in React Server Components</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Microsoft named an overall leader in KuppingerCole Leadership Compass for Generative AI Defense",
    "link": "https://techcommunity.microsoft.com/blog/microsoft-security-blog/microsoft-named-an-overall-leader-in-kuppingercole-leadership-compass-for-genera/4478093",
    "published": "Mon, 15 Dec 2025 18:05:00 +0000",
    "summary": "<p>Today, we are proud to share that Microsoft has been recognized as an overall leader in the KuppingerCole Leadership Compass for Generative AI Defense.</p>\n<p>The post <a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/microsoft-named-an-overall-leader-in-kuppingercole-leadership-compass-for-genera/4478093\">Microsoft named an overall leader in KuppingerCole Leadership Compass for Generative AI Defense</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Imposter for hire: How fake people can gain very real access",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/11/imposter-for-hire-how-fake-people-can-gain-very-real-access/",
    "published": "Thu, 11 Dec 2025 17:00:00 +0000",
    "summary": "<p>Fake employees are an emerging cybersecurity threat. Learn how they infiltrate organizations and what steps you can take to protect your business.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/11/imposter-for-hire-how-fake-people-can-gain-very-real-access/\">Imposter for hire: How fake people can gain very real access</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "From awareness to action: Building a security-first culture for the agentic AI era",
    "link": "https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/12/10/from-awareness-to-action-building-a-security-first-culture-for-the-agentic-ai-era/",
    "published": "Wed, 10 Dec 2025 18:00:00 +0000",
    "summary": "<p>The insights gained from Cybersecurity Awareness Month, right through to Microsoft Ignite 2025, demonstrate that security remains a top priority for business leaders.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/microsoft-cloud/blog/2025/12/10/from-awareness-to-action-building-a-security-first-culture-for-the-agentic-ai-era/\">From awareness to action: Building a security-first culture for the agentic AI era</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Clarity in complexity: New insights for transparent email security",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/10/clarity-in-complexity-new-insights-for-transparent-email-security/",
    "published": "Wed, 10 Dec 2025 17:00:00 +0000",
    "summary": "<p>Microsoft’s latest benchmarking report reveals how layered email defenses perform, offering real-world insights to strengthen protection and reduce risk.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/10/clarity-in-complexity-new-insights-for-transparent-email-security/\">Clarity in complexity: New insights for transparent email security</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Shai-Hulud 2.0: Guidance for detecting, investigating, and defending against the supply chain attack",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/09/shai-hulud-2-0-guidance-for-detecting-investigating-and-defending-against-the-supply-chain-attack/",
    "published": "Tue, 09 Dec 2025 21:41:32 +0000",
    "summary": "<p>The Shai‑Hulud&#160;2.0 supply chain attack represents one of the most significant cloud-native ecosystem compromises observed recently. Attackers maliciously modified hundreds of publicly available packages, targeting developer environments, continuous integration and continuous delivery (CI/CD) pipelines, and cloud-connected workloads to harvest credentials and configuration secrets. The Shai‑Hulud&#160;2.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/09/shai-hulud-2-0-guidance-for-detecting-investigating-and-defending-against-the-supply-chain-attack/\">Shai-Hulud 2.0: Guidance for detecting, investigating, and defending against the supply chain attack</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Changing the physics of cyber defense",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/09/changing-the-physics-of-cyber-defense/",
    "published": "Tue, 09 Dec 2025 17:00:00 +0000",
    "summary": "<p>Cyber defense is evolving. Find out how graph-powered strategies and AI can help organizations detect threats faster and improve security hygiene.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/09/changing-the-physics-of-cyber-defense/\">Changing the physics of cyber defense</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Stronger together: New Beazley collaboration enhances cyber resilience",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/08/stronger-together-new-beazley-collaboration-enhances-cyber-resilience/",
    "published": "Mon, 08 Dec 2025 17:00:00 +0000",
    "summary": "<p>To bolster security for our customers, we need to align with our ecosystem partners. Our new collaboration with Beazley as an incident response partner is a step in that direction.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/08/stronger-together-new-beazley-collaboration-enhances-cyber-resilience/\">Stronger together: New Beazley collaboration enhances cyber resilience</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "Microsoft named a leader in the 2025 Gartner® Magic Quadrant™ for Email Security",
    "link": "https://www.microsoft.com/en-us/security/blog/2025/12/05/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-email-security/",
    "published": "Fri, 05 Dec 2025 20:00:00 +0000",
    "summary": "<p>Microsoft has been named a Leader in the 2025 Gartner® Magic Quadrant™ for Email Security, which we believe highlights the innovative capabilities of Microsoft Defender for Office 365.</p>\n<p>The post <a href=\"https://www.microsoft.com/en-us/security/blog/2025/12/05/microsoft-named-a-leader-in-the-2025-gartner-magic-quadrant-for-email-security/\">Microsoft named a leader in the 2025 Gartner® Magic Quadrant™ for Email Security</a> appeared first on <a href=\"https://www.microsoft.com/en-us/security/blog\">Microsoft Security Blog</a>.</p>"
  },
  {
    "title": "TAG Bulletin: Q3 2025",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q3-2025/",
    "published": "Thu, 13 Nov 2025 16:00:00 +0000",
    "summary": "Our bulletin covering coordinated influence operation campaigns terminated on our platforms in Q3 2025."
  },
  {
    "title": "TAG Bulletin: Q2 2025",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q2-2025/",
    "published": "Mon, 21 Jul 2025 17:45:00 +0000",
    "summary": "Our bulletin covering coordinated influence operation campaigns terminated on our platforms in Q2 2025."
  },
  {
    "title": "TAG Bulletin: Q1 2025",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q1-2025/",
    "published": "Thu, 15 May 2025 17:30:00 +0000",
    "summary": "This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q1 2025. It was last updated on May 15, 2025.JanuaryWe terminated 12 YouT…"
  },
  {
    "title": "TAG Bulletin: Q4 2024",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q4-2024/",
    "published": "Tue, 17 Dec 2024 22:00:00 +0000",
    "summary": "This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q4 2024. It was last updated on February 19, 2024.OctoberWe terminated 11…"
  },
  {
    "title": "TAG Bulletin: Q3 2024",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q3-2024/",
    "published": "Thu, 12 Sep 2024 23:30:00 +0000",
    "summary": "This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q3 2024. It was last updated on January 14, 2025.JulyWe terminated 89 You…"
  },
  {
    "title": "State-backed attackers and commercial surveillance vendors repeatedly use the same exploits",
    "link": "https://blog.google/threat-analysis-group/state-backed-attackers-and-commercial-surveillance-vendors-repeatedly-use-the-same-exploits/",
    "published": "Thu, 29 Aug 2024 13:00:00 +0000",
    "summary": "an image of a blue square with the embedded text \"Google\" and \"Threat Analysis Group\""
  },
  {
    "title": "Iranian backed group steps up phishing campaigns against Israel, U.S.",
    "link": "https://blog.google/threat-analysis-group/iranian-backed-group-steps-up-phishing-campaigns-against-israel-us/",
    "published": "Wed, 14 Aug 2024 19:00:00 +0000",
    "summary": "Google’s Threat Analysis Group shares insights on APT42, an Iranian government-backed threat actor."
  },
  {
    "title": "Google disrupted over 10,000 instances of DRAGONBRIDGE activity in Q1 2024",
    "link": "https://blog.google/threat-analysis-group/google-disrupted-dragonbridge-activity-q1-2024/",
    "published": "Wed, 26 Jun 2024 10:00:00 +0000",
    "summary": "Today we are sharing updated insights about DRAGONBRIDGE, the most prolific IO actor Google’s Threat Analysis Group (TAG) tracks."
  },
  {
    "title": "TAG Bulletin: Q2 2024",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q2-2024/",
    "published": "Tue, 04 Jun 2024 23:00:00 +0000",
    "summary": "Our bulletin covering coordinated influence operation campaigns terminated on our platforms in Q2 2024."
  },
  {
    "title": "A review of zero-day in-the-wild exploits in 2023",
    "link": "https://blog.google/technology/safety-security/a-review-of-zero-day-in-the-wild-exploits-in-2023/",
    "published": "Wed, 27 Mar 2024 13:00:00 +0000",
    "summary": "Today, Google released its report “We’re All in this Together: A Year in Review of Zero-Days Exploited In-the-Wild in 2023.”"
  },
  {
    "title": "TAG Bulletin: Q1 2024",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q1-2024/",
    "published": "Wed, 06 Mar 2024 17:30:00 +0000",
    "summary": "This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q1 2024. It was last updated on July 8, 2024.JanuaryWe blocked 4 domains …"
  },
  {
    "title": "Tool of First Resort: Israel-Hamas War in Cyber",
    "link": "https://blog.google/technology/safety-security/tool-of-first-resort-israel-hamas-war-in-cyber/",
    "published": "Wed, 14 Feb 2024 00:01:00 +0000",
    "summary": "blue squares forming the abstract shape of an arrow set against a white background"
  },
  {
    "title": "Buying Spying: How the commercial surveillance industry works and what can be done about it",
    "link": "https://blog.google/threat-analysis-group/commercial-surveillance-vendors-google-tag-report/",
    "published": "Tue, 06 Feb 2024 10:00:00 +0000",
    "summary": "a blue square that reads \"Threat Analysis Group\""
  },
  {
    "title": "TAG Bulletin: Q4 2023",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q4-2023/",
    "published": "Fri, 19 Jan 2024 20:00:00 +0000",
    "summary": "This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q4 2023. It was last updated on January 19, 2024.OctoberWe terminated 8 Y…"
  },
  {
    "title": "Russian threat group COLDRIVER expands its targeting of Western officials to include the use of malware",
    "link": "https://blog.google/threat-analysis-group/google-tag-coldriver-russian-phishing-malware/",
    "published": "Thu, 18 Jan 2024 14:00:00 +0000",
    "summary": "an illustrated blue box with the phrase \"Threat Analysis Group\" in white"
  },
  {
    "title": "Zimbra 0-day used to target international government organizations",
    "link": "https://blog.google/threat-analysis-group/zimbra-0-day-used-to-target-international-government-organizations/",
    "published": "Thu, 16 Nov 2023 16:00:00 +0000",
    "summary": "a blue box that reads \"Threat Analysis Group\""
  },
  {
    "title": "Government-backed actors exploiting WinRAR vulnerability",
    "link": "https://blog.google/threat-analysis-group/government-backed-actors-exploiting-winrar-vulnerability/",
    "published": "Wed, 18 Oct 2023 15:00:00 +0000",
    "summary": "Google's Threat Analysis Group analyzes recent state-sponsored campaigns exploiting the WinRAR vulnerability, CVE-2023-38831."
  },
  {
    "title": "TAG Bulletin: Q3 2023",
    "link": "https://blog.google/threat-analysis-group/tag-bulletin-q3-2023/",
    "published": "Thu, 05 Oct 2023 18:30:00 +0000",
    "summary": "This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q3 2023. It was last updated on November 8, 2023."
  },
  {
    "title": "0-days exploited by commercial surveillance vendor in Egypt",
    "link": "https://blog.google/threat-analysis-group/0-days-exploited-by-commercial-surveillance-vendor-in-egypt/",
    "published": "Fri, 22 Sep 2023 17:00:00 +0000",
    "summary": "Last week Google’s Threat Analysis Group (TAG), in partnership with The Citizen Lab, discovered an in-the-wild 0-day exploit chain for iPhones. Developed by the commerci…"
  },
  {
    "title": "Active North Korean campaign targeting security researchers",
    "link": "https://blog.google/threat-analysis-group/active-north-korean-campaign-targeting-security-researchers/",
    "published": "Thu, 07 Sep 2023 15:00:00 +0000",
    "summary": "Threat Analysis Group shares findings on a new campaign by North Korean actors targeting security researchers."
  },
  {
    "title": "From Linear to Complex: An Upgrade in RansomHouse Encryption",
    "link": "https://unit42.paloaltonetworks.com/ransomhouse-encryption-upgrade/",
    "published": "Wed, 17 Dec 2025 11:00:54 +0000",
    "summary": "<p>Operators behind RansomHouse, a ransomware-as-a-service (RaaS) group, have upgraded their encryption methods from single-phase to complex and layered.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/ransomhouse-encryption-upgrade/\">From Linear to Complex: An Upgrade in RansomHouse Encryption</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Stay Secure: Why Cyber Hygiene Should Be Part of Your Personal Hygiene",
    "link": "https://unit42.paloaltonetworks.com/cyber-hygiene/",
    "published": "Wed, 17 Dec 2025 00:00:57 +0000",
    "summary": "<p>Cyber hygiene is just as vital as personal hygiene. Unit 42 shares tips for people of all experience levels to keep their digital lives secure. </p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/cyber-hygiene/\">Stay Secure: Why Cyber Hygiene Should Be Part of Your Personal Hygiene</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Exploitation of Critical Vulnerability in React Server Components (Updated December 12)",
    "link": "https://unit42.paloaltonetworks.com/cve-2025-55182-react-and-cve-2025-66478-next/",
    "published": "Fri, 12 Dec 2025 21:40:55 +0000",
    "summary": "<p>We discuss the CVSS 10.0-rated RCE vulnerability in the Flight protocol used by React Server Components. This is tracked as CVE-2025-55182. </p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/cve-2025-55182-react-and-cve-2025-66478-next/\">Exploitation of Critical Vulnerability in React Server Components (Updated December 12)</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Hamas-Affiliated Ashen Lepus Targets Middle Eastern Diplomatic Entities With New AshTag Malware Suite",
    "link": "https://unit42.paloaltonetworks.com/hamas-affiliate-ashen-lepus-uses-new-malware-suite-ashtag/",
    "published": "Thu, 11 Dec 2025 11:00:38 +0000",
    "summary": "<p>Hamas-affiliated threat actor Ashen Lepus (aka WIRTE) is conducting espionage with its new AshTag malware suite against Middle Eastern government entities. </p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/hamas-affiliate-ashen-lepus-uses-new-malware-suite-ashtag/\">Hamas-Affiliated Ashen Lepus Targets Middle Eastern Diplomatic Entities With New AshTag Malware Suite</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "01flip: Multi-Platform Ransomware Written in Rust",
    "link": "https://unit42.paloaltonetworks.com/new-ransomware-01flip-written-in-rust/",
    "published": "Wed, 10 Dec 2025 11:00:12 +0000",
    "summary": "<p>01flip is a new ransomware family fully written in Rust. Activity linked to 01flip points to alleged dark web data leaks. </p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/new-ransomware-01flip-written-in-rust/\">01flip: Multi-Platform Ransomware Written in Rust</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "New Prompt Injection Attack Vectors Through MCP Sampling",
    "link": "https://unit42.paloaltonetworks.com/model-context-protocol-attack-vectors/",
    "published": "Fri, 05 Dec 2025 23:00:59 +0000",
    "summary": "<p>Model Context Protocol connects LLM apps to external data sources or tools. We examine its security implications through various attack vectors.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/model-context-protocol-attack-vectors/\">New Prompt Injection Attack Vectors Through MCP Sampling</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "The Browser Defense Playbook: Stopping the Attacks That Start on Your Screen",
    "link": "https://unit42.paloaltonetworks.com/browser-defense-playbook/",
    "published": "Wed, 03 Dec 2025 00:00:04 +0000",
    "summary": "<p>85% of daily work occurs in the browser. Unit 42 outlines key security controls and strategies to make sure yours is secure.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/browser-defense-playbook/\">The Browser Defense Playbook: Stopping the Attacks That Start on Your Screen</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "The Golden Scale: 'Tis the Season for Unwanted Gifts",
    "link": "https://unit42.paloaltonetworks.com/new-shinysp1d3r-ransomware/",
    "published": "Wed, 26 Nov 2025 11:00:30 +0000",
    "summary": "<p>Unit 42 shares further updates of cybercrime group Scattered LAPSUS$ Hunters. Secure your organization this holiday season. </p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/new-shinysp1d3r-ransomware/\">The Golden Scale: &#039;Tis the Season for Unwanted Gifts</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "\"Shai-Hulud\" Worm Compromises npm Ecosystem in Supply Chain Attack (Updated November 26)",
    "link": "https://unit42.paloaltonetworks.com/npm-supply-chain-attack/",
    "published": "Tue, 25 Nov 2025 16:00:14 +0000",
    "summary": "<p>Self-replicating worm “Shai-Hulud” has compromised hundreds of software packages in a supply chain attack targeting the npm ecosystem. We discuss scope and more.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/npm-supply-chain-attack/\">&quot;Shai-Hulud&quot; Worm Compromises npm Ecosystem in Supply Chain Attack (Updated November 26)</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "The Dual-Use Dilemma of AI: Malicious LLMs",
    "link": "https://unit42.paloaltonetworks.com/dilemma-of-ai-malicious-llms/",
    "published": "Tue, 25 Nov 2025 11:00:26 +0000",
    "summary": "<p>The line between research tool and threat creation engine is thin. We examine the capabilities of WormGPT 4 and KawaiiGPT, two malicious LLMs.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/dilemma-of-ai-malicious-llms/\">The Dual-Use Dilemma of AI: Malicious LLMs</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Anatomy of an Akira Ransomware Attack: When a Fake CAPTCHA Led to 42 Days of Compromise",
    "link": "https://unit42.paloaltonetworks.com/fake-captcha-to-compromise/",
    "published": "Wed, 19 Nov 2025 00:00:01 +0000",
    "summary": "<p>Unit 42 outlines a Howling Scorpius attack delivering Akira ransomware that originated from a fake CAPTCHA and led to a 42-day compromise.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/fake-captcha-to-compromise/\">Anatomy of an Akira Ransomware Attack: When a Fake CAPTCHA Led to 42 Days of Compromise</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Digital Doppelgangers: Anatomy of Evolving Impersonation Campaigns Distributing Gh0st RAT",
    "link": "https://unit42.paloaltonetworks.com/impersonation-campaigns-deliver-gh0st-rat/",
    "published": "Fri, 14 Nov 2025 23:00:04 +0000",
    "summary": "<p>Two campaigns delivering Gh0st RAT to Chinese speakers show a deep understanding of the target population's virtual environment and online behavior.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/impersonation-campaigns-deliver-gh0st-rat/\">Digital Doppelgangers: Anatomy of Evolving Impersonation Campaigns Distributing Gh0st RAT</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "You Thought It Was Over? Authentication Coercion Keeps Evolving",
    "link": "https://unit42.paloaltonetworks.com/authentication-coercion/",
    "published": "Tue, 11 Nov 2025 04:30:09 +0000",
    "summary": "<p>A new type of authentication coercion attack exploits an obscure and rarely monitored remote procedure call (RPC) interface. </p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/authentication-coercion/\">You Thought It Was Over? Authentication Coercion Keeps Evolving</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "LANDFALL: New Commercial-Grade Android Spyware in Exploit Chain Targeting Samsung Devices",
    "link": "https://unit42.paloaltonetworks.com/landfall-is-new-commercial-grade-android-spyware/",
    "published": "Fri, 07 Nov 2025 11:00:23 +0000",
    "summary": "<p>Commercial-grade LANDFALL spyware exploits CVE-2025-21042 in Samsung Android’s image processing library. The spyware was embedded in malicious DNG files.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/landfall-is-new-commercial-grade-android-spyware/\">LANDFALL: New Commercial-Grade Android Spyware in Exploit Chain Targeting Samsung Devices</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Know Ourselves Before Knowing Our Enemies: Threat Intelligence at the Expense of Asset Management",
    "link": "https://unit42.paloaltonetworks.com/asset-management/",
    "published": "Wed, 05 Nov 2025 00:00:02 +0000",
    "summary": "<p>Effective cyber defense starts with knowing your own network. Unit 42 explains why asset management is the foundation of threat intelligence.</p>\n<p>The post <a href=\"https://unit42.paloaltonetworks.com/asset-management/\">Know Ourselves Before Knowing Our Enemies: Threat Intelligence at the Expense of Asset Management</a> appeared first on <a href=\"https://unit42.paloaltonetworks.com\">Unit 42</a>.</p>"
  },
  {
    "title": "Dormant Iran APT is Still Alive, Spying on Dissidents",
    "link": "https://www.darkreading.com/threat-intelligence/iran-apt-spying-dissidents",
    "published": "Thu, 18 Dec 2025 13:00:00 GMT",
    "summary": "&quot;Prince of Persia&quot; has rewritten the rules of persistence with advanced operational security and cryptographic communication with its command-and-control server."
  },
  {
    "title": "Critical Fortinet Flaws Under Active Attack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/critical-fortinet-flaws-under-active-attack",
    "published": "Wed, 17 Dec 2025 22:44:38 GMT",
    "summary": "Attackers targeted admin accounts, and once authenticated, exported device configurations including hashed credentials and other sensitive information."
  },
  {
    "title": "In Cybersecurity, Claude Leaves Other LLMs in the Dust",
    "link": "https://www.darkreading.com/cybersecurity-analytics/cybersecurity-claude-llms",
    "published": "Wed, 17 Dec 2025 22:01:58 GMT",
    "summary": "Anthropic proves that LLMs can be fairly resistant to abuse. Most developers are either incapable of building safer tools, or unwilling to invest in doing so."
  },
  {
    "title": "'Cellik' Android RAT Leverages Google Play Store",
    "link": "https://www.darkreading.com/threat-intelligence/cellik-android-rat-leverages-google-play-store",
    "published": "Wed, 17 Dec 2025 21:38:50 GMT",
    "summary": "The remote access Trojan lets an attacker remotely control a victim's phone and can generate malicious apps from inside the Play Store."
  },
  {
    "title": "Securing the Network Edge: A Comprehensive Framework for Modern Cybersecurity",
    "link": "https://www.darkreading.com/endpoint-security/securing-network-edge-comprehensive-framework-modern-cybersecurity",
    "published": "Wed, 17 Dec 2025 21:14:12 GMT",
    "summary": "The future of cybersecurity means defending everywhere. Securing IoT, cloud, and remote work requires a unified edge-to-cloud strategy. First in a three-part series."
  },
  {
    "title": "Securing the Future: Building Quantum-Safe Networks Today",
    "link": "https://www.darkreading.com/endpoint-security/securing-future-building-quantum-safe-networks-today",
    "published": "Wed, 17 Dec 2025 20:46:43 GMT",
    "summary": "As quantum computing advances, interoperable standards will be the key to making QKD practical, trusted, and future-proof."
  },
  {
    "title": "Attackers Use Stolen AWS Credentials in Cryptomining Campaign",
    "link": "https://www.darkreading.com/cloud-security/attackers-use-stolen-aws-credentials-cryptomining",
    "published": "Wed, 17 Dec 2025 16:33:22 GMT",
    "summary": "Threat actors wielding stolen AWS Identity and Access Management (IAM) credentials leverage Amazon EC and EC2 infrastructure across multiple customer environments."
  },
  {
    "title": "&quot;Fake Proof&quot; and AI Slop Hobble Defenders",
    "link": "https://www.darkreading.com/application-security/fake-proof-ai-slop-hobble-defenders",
    "published": "Wed, 17 Dec 2025 14:58:31 GMT",
    "summary": "In the React2Shell saga, non-working and trivial proof-of-concept exploits led to confusion and perhaps a false sense of security. Can the onslaught of PoCs be tamed?"
  },
  {
    "title": "Afripol Focuses on Regional Cyber Challenges, Deepening Cooperation",
    "link": "https://www.darkreading.com/cybersecurity-operations/afripol-focuses-regional-cyber-challenges-deepening-cooperation",
    "published": "Wed, 17 Dec 2025 07:00:00 GMT",
    "summary": "Rapid digitization, uneven cybersecurity know-how, and growing cybercriminal syndicates in the region have challenged law enforcement and prosecutors."
  },
  {
    "title": "Why a 17-Year-Old Built an AI Model to Expose Deepfake Maps",
    "link": "https://www.darkreading.com/threat-intelligence/why-17-year-old-built-ai-expose-deepfake-maps",
    "published": "Tue, 16 Dec 2025 22:53:00 GMT",
    "summary": "A high-school student is tackling the overlooked risk of AI-generated satellite imagery that could mislead governments and emergency responders."
  },
  {
    "title": "Why You Should Train Your SOC Like a Triathlete",
    "link": "https://www.darkreading.com/cybersecurity-operations/why-you-should-train-your-soc-like-triathlete",
    "published": "Tue, 16 Dec 2025 22:20:33 GMT",
    "summary": "The key elements in a security operations center's strategy map very closely to the swim/bike/run events in a triathlon. SOCs, like triathletes, perform well when their &quot;inputs&quot; are strong."
  },
  {
    "title": "Venezuelan Oil Company Downplays Alleged US Cyberattack",
    "link": "https://www.darkreading.com/cyber-risk/venezuela-oil-company-downplays-alleged-us-cyberattack",
    "published": "Tue, 16 Dec 2025 20:33:16 GMT",
    "summary": "But media reports described the attack as causing major disruption to PDVSA, the state-owned oil and natural gas company."
  },
  {
    "title": "Russia Hits Critical Orgs Via Misconfigured Edge Devices",
    "link": "https://www.darkreading.com/endpoint-security/russian-apt-attacking-critical-orgs-around-world",
    "published": "Tue, 16 Dec 2025 20:03:15 GMT",
    "summary": "Amazon detailed a long-running campaign by Russia against critical infrastructure organizations, particularly in the energy sector."
  },
  {
    "title": "Browser Extension Harvests 8M Users' AI Chatbot Data",
    "link": "https://www.darkreading.com/endpoint-security/chrome-extension-harvests-ai-chatbot-data",
    "published": "Tue, 16 Dec 2025 16:14:01 GMT",
    "summary": "Urban VPN Proxy, which claims to protect users' privacy, collects data from conversations with ChatGPT, Claude, Gemini, Copilot, and other AI assistants."
  },
  {
    "title": "Enterprises Gear Up Ahead of 2026's IT Transformation Shift",
    "link": "https://www.darkreading.com/cybersecurity-operations/enterprises-gear-up-for-2026-s-it-transformation",
    "published": "Tue, 16 Dec 2025 15:08:23 GMT",
    "summary": "Experts predict big changes are coming for IT infrastructure in 2026 driven by AI adoption, hybrid cloud strategies, and evolving security demands."
  },
  {
    "title": "How Cyber Insurance MGAs Shape Policies for Evolving Cyber-Risks",
    "link": "https://www.darkreading.com/cyber-risk/how-cyber-insurance-mga-shape-cyber-risk-policy",
    "published": "Mon, 15 Dec 2025 22:28:47 GMT",
    "summary": "Managing general agents help insurers navigate sectors where they lack expertise. A cybersecurity policy written by an MGA is more likely to reflect an understanding of the risks CISOs deal with."
  },
  {
    "title": "Apple Patches More Zero-Days Used in 'Sophisticated' Attack",
    "link": "https://www.darkreading.com/vulnerabilities-threats/apple-patches-more-zero-days-sophisticated-attack",
    "published": "Mon, 15 Dec 2025 21:25:20 GMT",
    "summary": "Two Apple zero-day vulnerabilities discovered this month have overlap with another mysterious zero-day flaw Google patched last week."
  },
  {
    "title": "Think Like an Attacker: Cybersecurity Tips From a CISO",
    "link": "https://www.darkreading.com/cybersecurity-operations/cybersecurity-tips-cato-networks-ciso",
    "published": "Mon, 15 Dec 2025 20:07:48 GMT",
    "summary": "Etay Maor, a cybersecurity strategist and professor, shares his journey, insights, and advice on breaking into the diverse and ever-evolving field of cybersecurity."
  },
  {
    "title": "Flaw in Hacktivist Ransomware Lets Victims Decrypt Own Files",
    "link": "https://www.darkreading.com/threat-intelligence/flaw-hacktivist-ransomware-victims-decrypt-files",
    "published": "Mon, 15 Dec 2025 15:33:15 GMT",
    "summary": "A new version of VolkLocker, wielded by the pro-Russia RaaS group CyberVolk, has some key enhancements but one fatal flaw."
  },
  {
    "title": "The CISO-COO Partnership: Protecting Operational Excellence",
    "link": "https://www.darkreading.com/cybersecurity-operations/the-ciso-coo-partnership-protecting-operational-excellence",
    "published": "Fri, 12 Dec 2025 21:12:13 GMT",
    "summary": "Digital transformation has made cybersecurity preparation part of operational resilience for most organizations. This calls for a new relationship between CISOs and COOs."
  },
  {
    "title": "React2Shell Exploits Flood the Internet as Attacks Continue",
    "link": "https://www.darkreading.com/threat-intelligence/react2shell-exploits-flood-internet-attacks-continue",
    "published": "Fri, 12 Dec 2025 20:11:43 GMT",
    "summary": "As exploitation activity against CVE-2025-55182 ramps up, researchers are finding some proof-of-concept exploits contain bypasses for web application firewall (WAF) rules."
  },
  {
    "title": "Vibe Coding: Innovation Demands Vigilance",
    "link": "https://www.darkreading.com/application-security/vibe-coding-innovation-demands-vigilance",
    "published": "Fri, 12 Dec 2025 20:07:23 GMT",
    "summary": "Unmanaged coding is indeed an alluring idea, but can introduce a host of significant cybersecurity dangers."
  },
  {
    "title": "Microsoft Will Bundle Security Copilot With M365 Enterprise Licenses",
    "link": "https://www.darkreading.com/cybersecurity-operations/microsoft-bundle-security-copilot-m365-enterprise-license",
    "published": "Fri, 12 Dec 2025 19:32:42 GMT",
    "summary": "The move aims to expand the use of Security Copilot and comes with the launch of 12 new agents from Microsoft at the company's Ignite conference last week."
  },
  {
    "title": "Supply Chain Attacks Targeting GitHub Actions Increased in 2025",
    "link": "https://www.darkreading.com/application-security/supply-chain-attacks-targeting-github-actions-increased-in-2025",
    "published": "Fri, 12 Dec 2025 18:37:53 GMT",
    "summary": "At this week's Black Hat Europe conference, two researchers urged developers to adopt a shared responsibility model for open source software and not leave it all up to GitHub to handle."
  },
  {
    "title": "Are Trade Concerns Trumping US Cybersecurity?",
    "link": "https://www.darkreading.com/cyber-risk/trade-concerns-trumping-cybersecurity",
    "published": "Fri, 12 Dec 2025 14:00:00 GMT",
    "summary": "The Trump administration appears to have dropped sanctions against Chinese actors for the Salt Typhoon attacks on US telecoms; but focusing on diplomacy alone misses the full picture, experts say."
  },
  {
    "title": "Hamas-Linked Hackers Probe Middle Eastern Diplomats",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/hamas-hackers-middle-eastern-diplomats",
    "published": "Fri, 12 Dec 2025 07:00:00 GMT",
    "summary": "Hamas's best hackers have been maturing, building better malware, and spreading their attacks more widely across the region."
  },
  {
    "title": "Money Mules Require Banks to Switch From Defense to Offense",
    "link": "https://www.darkreading.com/threat-intelligence/money-mules-require-banks-to-switch-from-defense-to-offense",
    "published": "Thu, 11 Dec 2025 23:13:38 GMT",
    "summary": "Financial institutions must be proactive when identifying and preventing fraudulent activity. Here are five &quot;mule personas&quot; to watch for."
  },
  {
    "title": "Encouraging Industry Voices to Write for the Commentary Section",
    "link": "https://www.darkreading.com/cybersecurity-operations/encouraging-industry-voices-write-commentary-section",
    "published": "Thu, 11 Dec 2025 22:48:10 GMT",
    "summary": "Dark Reading will continue to publish Tech Talks and Ask the Expert pieces in the Commentary section. Read on for submission guidelines."
  },
  {
    "title": "Attackers Exploited Gogs Zero-Day Flaw for Months",
    "link": "https://www.darkreading.com/vulnerabilities-threats/attackers-exploited-gogs-zero-day-months",
    "published": "Thu, 11 Dec 2025 20:11:43 GMT",
    "summary": "Wiz disclosed a still-unpatched vulnerability in self-hosted Git service Gogs, which is a bypass for a previous RCE bug disclosed last year."
  },
  {
    "title": "AI in OT Sparks Cascade of Complex Challenges",
    "link": "https://www.darkreading.com/ics-ot-security/ai-ot-too-incompatible-work-securely",
    "published": "Thu, 11 Dec 2025 14:50:59 GMT",
    "summary": "Using artificial intelligence in operational technology environments could be a bumpy ride full of trust issues and security challenges."
  },
  {
    "title": "Copilot's No-Code AI Agents Liable to Leak Company Data",
    "link": "https://www.darkreading.com/application-security/copilot-no-code-ai-agents-leak-company-data",
    "published": "Thu, 11 Dec 2025 10:00:00 GMT",
    "summary": "Microsoft puts the power of AI in the hands of everyday non-technical Joes. It's a nice idea, and a surefire recipe for security issues."
  },
  {
    "title": "Storm-0249 Abuses EDR Processes in Stealthy Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/storm-0249-edr-processes-stealthy-attacks",
    "published": "Wed, 10 Dec 2025 21:59:32 GMT",
    "summary": "The initial access broker has been weaponizing endpoint detection and response (EDR) platforms and Windows utilities in recent high-precision attacks."
  },
  {
    "title": "ClickFix Style Attack Uses Grok, ChatGPT for Malware Delivery",
    "link": "https://www.darkreading.com/vulnerabilities-threats/clickfix-style-attack-grok-chatgpt-malware",
    "published": "Wed, 10 Dec 2025 21:02:30 GMT",
    "summary": "A new twist on the social engineering tactic is making waves, combining SEO poisoning and legitimate AI domains to install malware on victims' computers."
  },
  {
    "title": "Feds: Pro-Russia Hacktivists Target US Critical Infrastructure",
    "link": "https://www.darkreading.com/threat-intelligence/hactivists-target-critical-infrastructure",
    "published": "Wed, 10 Dec 2025 12:56:02 GMT",
    "summary": "So far the attacks, which compromise virtual network computing (VNC) connections in OT systems, have not been particularly destructive, but this could change as they evolve."
  },
  {
    "title": "Japanese Firms Suffer Long Tail of Ransomware Damage",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/japanese-firms-suffer-long-tail-ransomware-damage",
    "published": "Wed, 10 Dec 2025 00:00:00 GMT",
    "summary": "Ransomware actors have targeted manufacturers, retailers, and the Japanese government, with many organizations requiring months to recover."
  },
  {
    "title": "Microsoft Fixes Exploited Zero Day in Light Patch Tuesday",
    "link": "https://www.darkreading.com/application-security/microsoft-fixes-exploited-zero-day-light-patch-tuesday",
    "published": "Tue, 09 Dec 2025 22:24:18 GMT",
    "summary": "Proof-of-concept exploit code is publicly available for two other flaws in this month's Patch Tuesday. In total, the company issued patches for more than 1,150 flaws this year."
  },
  {
    "title": "Packer-as-a-Service Shanya Hides Ransomware, Kills EDR",
    "link": "https://www.darkreading.com/threat-intelligence/packer-as-a-service-shanya-hides-ransomware-kills-edr",
    "published": "Tue, 09 Dec 2025 20:10:32 GMT",
    "summary": "Shanya is the latest in an emerging field of packing malware, selling obfuscation functionality in order to help ransomware actors reach their target."
  },
  {
    "title": "Analysts Warn of Cybersecurity Risks in Humanoid Robots",
    "link": "https://www.darkreading.com/ics-ot-security/cybersecurity-risks-humanoid-robots",
    "published": "Tue, 09 Dec 2025 16:41:27 GMT",
    "summary": "Think &quot;Blade Runner,&quot; but the robots can be hacked more easily than your home computer."
  },
  {
    "title": "Gemini Enterprise No-Click Flaw Exposes Sensitive Data",
    "link": "https://www.darkreading.com/remote-workforce/gemini-enterprise-exposes-sensitive-data",
    "published": "Tue, 09 Dec 2025 12:08:41 GMT",
    "summary": "Google has fixed a critical vulnerability that enabled attackers to add malicious instructions to common documents to exfiltrate sensitive corporate information."
  },
  {
    "title": "Apache Issues Max-Severity Tika CVE After Patch Miss",
    "link": "https://www.darkreading.com/application-security/apache-max-severity-tika-cve-patch-miss",
    "published": "Mon, 08 Dec 2025 22:01:47 GMT",
    "summary": "The Apache Software Foundation's earlier fix for a critical Tika flaw missed the full scope of the vulnerability, prompting an updated advisory and CVE."
  },
  {
    "title": "Exploitation Activity Ramps Up Against React2Shell",
    "link": "https://www.darkreading.com/vulnerabilities-threats/exploitation-activity-ramps-react2shell",
    "published": "Mon, 08 Dec 2025 21:41:25 GMT",
    "summary": "Attacks against CVE-2025-55182, which began almost immediately after public disclosure last week, have increased as more threat actors take advantage of the flaw."
  },
  {
    "title": "US Treasury Tracks $4.5B in Ransom Payments since 2013",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/us-treasury-45b-ransom-payments-2013",
    "published": "Mon, 08 Dec 2025 20:21:00 GMT",
    "summary": "The US Treasury's Financial Crimes Enforcement Network shared data showing how dramatically ransomware attacks have changed over time."
  },
  {
    "title": "'Broadside' Mirai Variant Targets Maritime Logistics Sector",
    "link": "https://www.darkreading.com/threat-intelligence/broadside-mirai-variant-maritime-logistics",
    "published": "Mon, 08 Dec 2025 11:17:12 GMT",
    "summary": "&quot;Broadside&quot; is targeting a critical flaw in DVR systems to conduct command injection attacks, which can hijack devices to achieve persistence and move laterally."
  },
  {
    "title": "Rust Code Delivers Better Security, Also Streamlines DevOps",
    "link": "https://www.darkreading.com/application-security/rust-code-delivers-better-security-streamlines-devops",
    "published": "Fri, 05 Dec 2025 22:01:05 GMT",
    "summary": "Software teams at Google and other Rust adopters see safer code when using the memory-safe language, as well as fewer rollbacks and less code review."
  },
  {
    "title": "India Rolls Back App Mandate Amid Surveillance Concerns",
    "link": "https://www.darkreading.com/cybersecurity-operations/india-app-mandate-surveillance-concerns",
    "published": "Fri, 05 Dec 2025 20:06:26 GMT",
    "summary": "Remember when Apple put that U2 album in everyone's music libraries? India wanted to do that to all of its citizens, but with a cybersecurity app. It wasn't a good idea."
  },
  {
    "title": "Threat Landscape Grows Increasingly Dangerous for Manufacturers",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/threat-landscape-increasingly-dangerous-manufacturers",
    "published": "Fri, 05 Dec 2025 15:34:58 GMT",
    "summary": "Manufacturers are the top target for cyberattacks in 2025 because of their still-plentiful cybersecurity gaps and a lack of expertise."
  },
  {
    "title": "React2Shell Vulnerability Under Attack From China-Nexus Groups",
    "link": "https://www.darkreading.com/vulnerabilities-threats/react2shell-under-attack-china-nexus-groups",
    "published": "Fri, 05 Dec 2025 15:14:26 GMT",
    "summary": "A maximum-severity vulnerability affecting the React JavaScript library has been exploited in the wild, further stressing the need to patch now."
  },
  {
    "title": "CISOs Should Be Asking These Quantum Questions Today",
    "link": "https://www.darkreading.com/cybersecurity-operations/cisos-should-be-asking-these-quantum-questions-today",
    "published": "Fri, 05 Dec 2025 15:00:00 GMT",
    "summary": "As quantum quietly moves beyond lab experiment and into production workflows, here's what enterprise security leaders should be focused on, according to Lineswala."
  },
  {
    "title": "How Agentic AI Can Boost Cyber Defense",
    "link": "https://www.darkreading.com/cybersecurity-analytics/how-agentic-ai-can-boost-cyber-defense",
    "published": "Thu, 04 Dec 2025 23:05:15 GMT",
    "summary": "Transurban head of cyber defense Muhammad Ali Paracha shares how his team is automating the triaging and scoring of security threats as part of the Black Hat Middle East conference."
  },
  {
    "title": "A Tale of Two CISOs: Why An Engineering-Focused CISO Can Be a Liability",
    "link": "https://www.darkreading.com/cyber-risk/why-an-engineering-focused-ciso-can-be-a-liability",
    "published": "Thu, 04 Dec 2025 22:13:41 GMT",
    "summary": "When hiring a CISO, understand the key difference between engineering and holistic security leaders."
  }
]